Paciente8159/uCNC/uCNC/src/hal/mcus/rp2350/mcumap_rp2350.h
#define ALARM_TIMER RTC_TIMER
#define RTC_ALARM 0
#define SERVO_ALARM 1
#define ONESHOT_ALARM 2

#ifdef IC74HC595_CUSTOM_SHIFT_IO
#ifdef IC74HC595_COUNT
#undef IC74HC595_COUNT
#endif
// forces IC74HC595_COUNT to 4 to prevent errors
#define IC74HC595_COUNT 4
#endif

#define __timer_irq__(X) (TIMER0_IRQ_0 + X)
#define _timer_irq_(X) __timer_irq__(X)

#define ITP_TIMER_IRQ _timer_irq_(ITP_TIMER)
#define RTC_TIMER_IRQ _timer_irq_(RTC_TIMER)
#define ALARM_TIMER_IRQ _timer_irq_(ALARM_TIMER)

#ifndef BYTE_OPS
#define BYTE_OPS
#define SETBIT(x, y) ((x) |= (1UL << (y)))    /* Set bit y in byte x*/
#define CLEARBIT(x, y) ((x) &= ~(1UL << (y))) /* Clear bit y in byte x*/
#define CHECKBIT(x, y) ((x) & (1UL << (y)))   /* Check bit y in byte x*/
#define TOGGLEBIT(x, y) ((x) ^= (1UL << (y))) /* Toggle bit y in byte x*/

#define SETFLAG(x, y) ((x) |= (y))    /* Set byte y in byte x*/
#define CLEARFLAG(x, y) ((x) &= ~(y)) /* Clear byte y in byte x*/
#define CHECKFLAG(x, y) ((x) & (y))   /* Check byte y in byte x*/
#define TOGGLEFLAG(x, y) ((x) ^= (y)) /* Toggle byte y in byte x*/
#endif

#define mcu_config_output(X) pinMode(__indirect__(X, BIT), OUTPUT)
#define mcu_config_pwm(X, freq)                                                \
  {                                                                            \
    pinMode(__indirect__(X, BIT), OUTPUT);                                     \
    analogWriteRange(255);                                                     \
    analogWriteFreq(freq);                                                     \
    analogWriteResolution(8);                                                  \
  }
#define mcu_config_input(X) pinMode(__indirect__(X, BIT), INPUT)
#define mcu_config_analog(X) mcu_config_input(X)
#define mcu_config_pullup(X) pinMode(__indirect__(X, BIT), INPUT_PULLUP)
#define mcu_config_input_isr(X)                                                \
  attachInterrupt(digitalPinToInterrupt(__indirect__(X, BIT)), mcu_din_isr,    \
                  CHANGE)

#define mcu_get_input(X) CHECKBIT(sio_hw->gpio_in, __indirect__(X, BIT))
#define mcu_get_output(X) CHECKBIT(sio_hw->gpio_out, __indirect__(X, BIT))
#define mcu_set_output(X)                                                      \
  ({ sio_hw->gpio_set = (1UL << __indirect__(X, BIT)); })
#define mcu_clear_output(X)                                                    \
  ({ sio_hw->gpio_clr = (1UL << __indirect__(X, BIT)); })
#define mcu_toggle_output(X)                                                   \
  ({ sio_hw->gpio_togl = (1UL << __indirect__(X, BIT)); })

extern uint8_t rp2350_pwm[16];
#define mcu_set_pwm(X, Y)                                                      \
  {                                                                            \
    rp2350_pwm[X - PWM_PINS_OFFSET] = Y;                                       \
    analogWrite(__indirect__(X, BIT), Y);                                      \
  }
#define mcu_get_pwm(X) (rp2350_pwm[X - PWM_PINS_OFFSET])
#define mcu_get_analog(X) analogRead(__indirect__(X, BIT))

#define mcu_millis() to_ms_since_boot(get_absolute_time())
#define mcu_micros() to_us_since_boot(get_absolute_time())
#define mcu_free_micros() (mcu_micros() % 1000)

#include "cmsis_gcc.h"
#define mcu_enable_global_isr __enable_irq
#define mcu_disable_global_isr __disable_irq
#define mcu_get_global_isr() (__get_PRIMASK() == 0u)
#define mcu_in_isr_context() (__get_IPSR() != 0)

#ifdef ENABLE_WIFI
#ifndef ENABLE_SOCKETS
#define ENABLE_SOCKETS
#endif
#endif

#ifndef MCU_HAS_FLASHUPDATE
#define MCU_HAS_FLASHUPDATE
#endif

#if (defined(ENABLE_SOCKETS) || defined(ENABLE_BLUETOOTH))
#ifndef BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#define BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#endif
#endif

#define USE_CUSTOM_BUFFER_IMPLEMENTATION
#include <pico/util/queue.h>
#define DECL_BUFFER(type, name, size)                                          \
  static queue_t name##_bufferdata;                                            \
  ring_buffer_t name = {0,    0,           0, (uint8_t *)&name##_bufferdata,   \
                        size, sizeof(type)}
#define BUFFER_INIT(type, name, size)                                          \
  extern ring_buffer_t name;                                                   \
  queue_init((queue_t *)name.data, sizeof(type), size)
#define BUFFER_WRITE_AVAILABLE(buffer)                                         \
  (buffer.size - queue_get_level((queue_t *)buffer.data))
#define BUFFER_READ_AVAILABLE(buffer) (queue_get_level((queue_t *)buffer.data))
#define BUFFER_EMPTY(buffer) queue_is_empty((queue_t *)buffer.data)
#define BUFFER_FULL(buffer) queue_is_full((queue_t *)buffer.data)
#define BUFFER_PEEK(buffer, ptr)                                               \
  if (!queue_try_peek((queue_t *)buffer.data, ptr)) {                          \
    memset(ptr, 0, buffer.elem_size);                                          \
  }
#define BUFFER_TRY_DEQUEUE(buffer, ptr)                                        \
  if (!queue_try_remove((queue_t *)buffer.data, ptr)) {                        \
    memset(ptr, 0, buffer.elem_size);                                          \
  }
#define BUFFER_DEQUEUE(buffer, ptr)                                            \
  do {                                                                         \
  } while (!queue_try_remove((queue_t *)buffer.data, ptr))
#define BUFFER_TRY_ENQUEUE(buffer, ptr)                                        \
  queue_try_add((queue_t *)buffer.data, ptr)
#define BUFFER_ENQUEUE(buffer, ptr)                                            \
  do {                                                                         \
  } while (!queue_try_add((queue_t *)buffer.data, ptr))
#define BUFFER_WRITE(buffer, ptr, len, written)                                \
  ({                                                                           \
    for (uint8_t i = 0; i < len; i++) {                                        \
      if (!queue_try_add((queue_t *)buffer.data, &ptr[i])) {                   \
        break;                                                                 \
      }                                                                        \
      written++;                                                               \
    }                                                                          \
  })
#define BUFFER_READ(buffer, ptr, len, read)                                    \
  ({                                                                           \
    for (uint8_t i = 0; i < len; i++) {                                        \
      if (!queue_try_remove((queue_t *)buffer.data, &ptr[i])) {                \
        break;                                                                 \
      }                                                                        \
      read++;                                                                  \
    }                                                                          \
  })
#define BUFFER_CLEAR(buffer)                                                   \
  while (!queue_is_empty((queue_t *)buffer.data)) {                            \
    queue_try_remove((queue_t *)buffer.data, NULL);                            \
  }

/**
 * Run code on multicore mode
 * Launches code on core 0
 * Runs communications on core 0
 * Runs CNC loop on core 1
 * **/
#ifdef RP2350_RUN_MULTICORE
/**
 * Launch multicore
 * **/
extern void rp2350_core1_loop();
#define ucnc_init()                                                            \
  cnc_init();                                                                  \
  rp2040.fifo.begin(2);                                                        \
  delay(1);                                                                    \
  multicore_launch_core1(rp2350_core1_loop)
extern void rp2040_core0_loop();
extern void rp2350_core0_loop();
#define ucnc_run() rp2350_core0_loop()

#endif

#ifdef __cplusplus
}
#endif

#endif
